# Read Baby Name Data

#### Sample Solution for Project 1.1

In [1]:
import pandas as pd

### Task 1

Inspect the file yob2021.txt in a text editor. What do you observe about the structure of the file?

*A: 3 columns, commas as separators, no headers, no obvious problems.*

### Task 2

Read the file `yob2021.txt` into pandas.

In [2]:
df = pd.read_csv('data/yob2021.txt', names=['name', 'gender', 'count'])

### Task 3

Print the first 10 rows.

In [3]:
df.head()

        name gender  count
0     Olivia      F  17728
1       Emma      F  15433
2  Charlotte      F  13285
3     Amelia      F  12952
4        Ava      F  12759

### Task 4

Display the number of rows and columns.

In [4]:
df.shape

(31537, 3)

### Task 5

Calculate the total number of babies born in 2021, i.e. the sum of the third column.

In [5]:
# using a variable, because we will use it later
total = df['count'].sum()
total

3361375

### Task 6

Like Task 5, but calculate the sum for boys and girls separately.

In [6]:
df.groupby('gender')['count'].sum()

gender
F    1627098
M    1734277
Name: count, dtype: int64

### Task 7

Check if your name occurs in the data.

In [7]:
# now the name in the index becomes helpful
df.set_index('name', inplace=True)

In [8]:
# here is how I would do it
df.loc['Kristian']

         gender  count
name
Kristian      F     15
Kristian      M    251

In [9]:
# found with a student. The regex is super useful to check for variants.
# ^ and $ are necessary to limit the string, axis=0 searches row indices
df.filter(regex='^Kr[iy]sti.{2}$', axis=0)

         gender  count
name
Kristina      F    170
Kristine      F     54
Kristian      F     15
Krystina      F      8
Kristian      M    251
Krystian      M     23

### Task 8

Calculate the percentage of girls and boys among the total births.

In [10]:
(df.groupby('gender').sum() / total * 100).round(2)

        count
gender
F       48.41
M       51.59

### Task 9

Create a table that contains the top 5 girls names and top 5 boys names.

In [11]:
# my own short solution
result = df.groupby('gender').head(5)
result

          gender  count
name
Olivia         F  17728
Emma           F  15433
Charlotte      F  13285
Amelia         F  12952
Ava            F  12759
Liam           M  20272
Noah           M  18739
Oliver         M  14616
Elijah         M  12708
James          M  12367

### Task 10

Write the data from task 9 to an Excel spreadsheet.

In [12]:
result.to_excel('result_project1.1.xlsx')

In [13]:
# re-ran notebook to check whether everything still works and to reset line numbers